Tekla Open API Reference for Tekla Structures 2025
BaseComponent Fields
The BaseComponent type exposes the following members.
Fields
Name | Description
ClassFromAttributeFile
 A constant integer defining that the class is to be read from the attribute file. The class must be set to this constant value before inserting the component.
ConnectionCodeFromAttributeFile
 A constant string defining that the connection code is to be read from the attribute file. The connection code must be set to this constant value before inserting the component.
CUSTOM_OBJECT_NUMBER
 The component number to be used when calling a custom component.
PLUGIN_OBJECT_NUMBER
 The component number to be used when calling a plug-in or a type derived from the connection base.
Top
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace